"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.CategoriesData = void 0;
exports.CategoriesData = [
    {
        name: 'Бизнес и карьера',
        children: [
            'Управление командой',
            'Маркетинг и реклама',
            'Продажи и переговоры',
            'Личный бренд',
            'Резюме и собеседование',
            'Тайм-менеджмент',
            'Проектное управление',
            'Предпринимательство',
        ],
    },
    {
        name: 'Творчество и искусство',
        children: [
            'Рисование и иллюстрация',
            'Фотография',
            'Видеомонтаж',
            'Музыка и звук',
            'Актёрское мастерство',
            'Креативное письмо',
            'Арт-терапия',
            'Декор и DIY',
        ],
    },
    {
        name: 'Иностранные языки',
        children: [
            'Английский',
            'Французский',
            'Испанский',
            'Немецкий',
            'Китайский',
            'Японский',
            'Подготовка к экзаменам',
        ],
    },
    {
        name: 'Образование и развитие',
        children: [
            'Личностное развитие',
            'Навыки обучения',
            'Когнитивные техники',
            'Скорочтение',
            'Навыки преподавания',
            'Коучинг',
        ],
    },
    {
        name: 'Здоровье и лайфстайл',
        children: [
            'Йога и медитация',
            'Питание и ЗОЖ',
            'Ментальное здоровье',
            'Осознанность',
            'Физические тренировки',
            'Сон и восстановление',
            'Баланс жизни и работы',
        ],
    },
    {
        name: 'Дом и уют',
        children: [
            'Уборка и организация',
            'Домашние финансы',
            'Приготовление еды',
            'Домашние растения',
            'Ремонт',
            'Хранение вещей',
        ],
    },
    {
        name: 'IT и технологии',
        children: [
            'Веб-разработка',
            'Мобильная разработка',
            'Data Science',
            'Кибербезопасность',
            'DevOps',
            'UI/UX дизайн',
            'Тестирование (QA)',
            '1С',
        ],
    },
    {
        name: 'Спорт и активный отдых',
        children: [
            'Фитнес',
            'Бег и триатлон',
            'Командные виды спорта',
            'Боевые искусства',
            'Танцы',
            'Экстремальный спорт',
            'Плавание',
            'Зимние виды спорта',
        ],
    },
];
//# sourceMappingURL=seed-categories.data.js.map